In [2]:
import pandas as pd

In [8]:
dataFrame=pd.read_excel("book.xlsx")

In [10]:
dataFrame

  Unnamed: 0  Salary   Yas Department
0    Lorelai    1234  67.0   Software
1       Rory    3243  43.0       Sale
2       Dean  324564  22.0        NaN
3       Dave     324   NaN  Marketing
4       Lane    5443  53.0    Finance

In [14]:
filledValues=dataFrame.dropna()

In [16]:
filledValues

  Unnamed: 0  Salary   Yas Department
0    Lorelai    1234  67.0   Software
1       Rory    3243  43.0       Sale
4       Lane    5443  53.0    Finance

In [22]:
filledValues.to_excel("NewSalary.xlsx")